<?xml version="1.0" encoding="UTF-8"?><rss version="2.0"
	xmlns:content="http://purl.org/rss/1.0/modules/content/"
	xmlns:wfw="http://wellformedweb.org/CommentAPI/"
	xmlns:dc="http://purl.org/dc/elements/1.1/"
	xmlns:atom="http://www.w3.org/2005/Atom"
	xmlns:sy="http://purl.org/rss/1.0/modules/syndication/"
	xmlns:slash="http://purl.org/rss/1.0/modules/slash/"
	>

<channel>
	<title>底层教程归档 - SZUEA</title>
	<atom:link href="/category/%E5%BA%95%E5%B1%82%E6%95%99%E7%A8%8B/feed/" rel="self" type="application/rss+xml" />
	<link>/category/底层教程/</link>
	<description>深圳大学电子协会</description>
	<lastBuildDate>Mon, 07 Aug 2023 13:35:24 +0000</lastBuildDate>
	<language>zh-CN</language>
	<sy:updatePeriod>
	hourly	</sy:updatePeriod>
	<sy:updateFrequency>
	1	</sy:updateFrequency>
	<generator>https://wordpress.org/?v=6.3</generator>

<image>
	<url>/wp-content/uploads/2023/08/8db18b66e5f38cff2edcf70d931da83e-3.png</url>
	<title>底层教程归档 - SZUEA</title>
	<link>/category/底层教程/</link>
	<width>32</width>
	<height>32</height>
</image> 
	<item>
		<title>Raft：一种更容易理解的共识算法</title>
		<link>/2023/08/07/raft_tutorial/</link>
					<comments>/2023/08/07/raft_tutorial/#respond</comments>
		
		<dc:creator><![CDATA[SZUEA]]></dc:creator>
		<pubDate>Mon, 07 Aug 2023 13:35:22 +0000</pubDate>
				<category><![CDATA[底层教程]]></category>
		<guid isPermaLink="false">/?p=568</guid>

					<description><![CDATA[<p>&#26412;&#25991;&#23558;&#20174;&#19977;&#20010;&#26495 &#8230;</p>
<p><a rel="nofollow" href="/2023/08/07/raft_tutorial/">Raft：一种更容易理解的共识算法</a>最先出现在<a rel="nofollow" href="/">SZUEA</a>。</p>
]]></description>
										<content:encoded><![CDATA[<p class="wp-block-paragraph ">&#26412;&#25991;&#23558;&#20174;&#19977;&#20010;&#26495;&#22359;&#20171;&#32461;Raft&#36825;&#31181;&#20849;&#35782;&#31639;&#27861;&#65306;</p>


<ul style="" class="wp-block-list ">
<li>&#20849;&#35782;&#31639;&#27861;&#31616;&#20171;</li>



<li>&#22797;&#21046;&#29366;&#24577;&#26426;</li>



<li>Raft&#30340;&#19977;&#20010;&#23376;&#27169;&#22359;</li>
</ul>


<h4 class="wp-block-heading wp-block-heading" id="1e38081e4bb80e4b988e698afe585b1e8af86e7ae97e6b395-consensus-algorithm">1&#12289;&#20160;&#20040;&#26159;&#20849;&#35782;&#31639;&#27861; (Consensus Algorithm)</h4>


<p class="wp-block-paragraph ">&#20849;&#35782;&#65288;Consensus&#65289;&#36825;&#20010;&#26415;&#35821;&#24456;&#22810;&#26102;&#20505;&#20250;&#19982;&#19968;&#33268;&#24615;&#65288;Consistency&#65289;&#26415;&#35821;&#25918;&#22312;&#19968;&#36215;&#35752;&#35770;&#12290;&#20005;&#35880;&#22320;&#35762;&#65292;&#20004;&#32773;&#30340;&#21547;&#20041;&#24182;&#19981;&#23436;&#20840;&#30456;&#21516;&#12290;</p>


<p class="wp-block-paragraph ">&#19968;&#33268;&#24615;&#30340;&#21547;&#20041;&#27604;&#20849;&#35782;&#23485;&#27867;&#65292;&#22312;&#19981;&#21516;&#22330;&#26223;&#65288;&#22522;&#20110;&#20107;&#21153;&#30340;&#25968;&#25454;&#24211;&#12289;&#20998;&#24067;&#24335;&#31995;&#32479;&#31561;&#65289;&#19979;&#24847;&#20041;&#19981;&#21516;&#12290;&#20855;&#20307;&#21040;&#20998;&#24067;&#24335;&#31995;&#32479;&#22330;&#26223;&#19979;&#65292;&#19968;&#33268;&#24615;&#25351;&#30340;&#26159;&#22810;&#20010;&#21103;&#26412;&#23545;&#22806;&#21576;&#29616;&#30340;&#29366;&#24577;&#12290;&#22914;&#39034;&#24207;&#19968;&#33268;&#24615;&#12289;&#32447;&#24615;&#19968;&#33268;&#24615;&#65292;&#25551;&#36848;&#20102;&#22810;&#33410;&#28857;&#23545;&#25968;&#25454;&#29366;&#24577;&#30340;&#20849;&#21516;&#32500;&#25252;&#33021;&#21147;&#12290;&#32780;&#20849;&#35782;&#65292;&#21017;&#29305;&#25351;&#22312;&#20998;&#24067;&#24335;&#31995;&#32479;&#20013;&#22810;&#20010;&#33410;&#28857;&#20043;&#38388;&#23545;&#26576;&#20010;&#20107;&#24773;&#65288;&#20363;&#22914;&#22810;&#20010;&#20107;&#21153;&#35831;&#27714;&#65292;&#20808;&#25191;&#34892;&#35841;&#65311;&#65289;&#36798;&#25104;&#19968;&#33268;&#30475;&#27861;&#30340;&#36807;&#31243;&#12290;&#22240;&#27492;&#65292;&#36798;&#25104;&#26576;&#31181;&#20849;&#35782;&#24182;&#19981;&#24847;&#21619;&#30528;&#23601;&#20445;&#38556;&#20102;&#19968;&#33268;&#24615;&#12290;</p>


<p class="wp-block-paragraph ">&#23454;&#36341;&#20013;&#65292;&#35201;&#20445;&#38556;&#31995;&#32479;&#28385;&#36275;&#19981;&#21516;&#31243;&#24230;&#30340;&#19968;&#33268;&#24615;&#65292;&#24448;&#24448;&#38656;&#35201;&#36890;&#36807;&#20849;&#35782;&#31639;&#27861;&#26469;&#36798;&#25104;&#12290;</p>


<p class="wp-block-paragraph ">&#20849;&#35782;&#31639;&#27861;&#35299;&#20915;&#30340;&#26159;&#20998;&#24067;&#24335;&#31995;&#32479;&#23545;&#26576;&#20010;&#25552;&#26696;&#65288;Proposal&#65289;&#65292;&#22823;&#37096;&#20998;&#33410;&#28857;&#36798;&#25104;&#19968;&#33268;&#24847;&#35265;&#30340;&#36807;&#31243;&#12290;&#25552;&#26696;&#30340;&#21547;&#20041;&#22312;&#20998;&#24067;&#24335;&#31995;&#32479;&#20013;&#21313;&#20998;&#23485;&#27867;&#65292;&#22914;&#22810;&#20010;&#20107;&#20214;&#21457;&#29983;&#30340;&#39034;&#24207;&#12289;&#26576;&#20010;&#38190;&#23545;&#24212;&#30340;&#20540;&#12289;&#35841;&#26159;&#20027;&#33410;&#28857;&hellip;&hellip;&#31561;&#31561;&#12290;&#21487;&#20197;&#35748;&#20026;&#20219;&#20309;&#21487;&#20197;&#36798;&#25104;&#19968;&#33268;&#30340;&#20449;&#24687;&#37117;&#26159;&#19968;&#20010;&#25552;&#26696;&#12290;</p>


<h5 class="wp-block-heading wp-block-heading" id="rafte585b1e8af86e7ae97e6b395e7ae80e4bb8b"><strong>Raft&#20849;&#35782;&#31639;&#27861;&#31616;&#20171;</strong></h5>


<p class="wp-block-paragraph ">Raft&#26159;&#19968;&#31181;&#26032;&#22411;&#26131;&#20110;&#29702;&#35299;&#30340;&#20998;&#24067;&#24335;&#19968;&#33268;&#24615;&#22797;&#21046;&#21327;&#35758;&#65292;&#30001;&#26031;&#22374;&#31119;&#22823;&#23398;&#30340;Diego Ongaro&#21644;John Ousterhout<a href="https://link.zhihu.com/?target=http%3A//wiki.baidu.com/download/attachments/142056196/raft.pdf%3Fversion%3D1%26modificationDate%3D1457941130000%26api%3Dv2">&#25552;&#20986;</a>&#65292;&#20316;&#20026;<a href="https://link.zhihu.com/?target=https%3A//ramcloud.atlassian.net/wiki/display/RAM/RAMCloud">RAMCloud</a>&#39033;&#30446;&#20013;&#30340;&#20013;&#24515;&#21327;&#35843;&#32452;&#20214;&#12290;Raft&#26159;&#19968;&#31181;Leader-Based&#30340;Multi-Paxos&#21464;&#31181;&#65292;&#30456;&#27604;Paxos&#12289;Zab&#12289;View Stamped Replication&#31561;&#21327;&#35758;&#25552;&#20379;&#20102;&#26356;&#23436;&#25972;&#26356;&#28165;&#26224;&#30340;&#21327;&#35758;&#25551;&#36848;&#65292;&#24182;&#25552;&#20379;&#20102;&#28165;&#26224;&#30340;&#33410;&#28857;&#22686;&#21024;&#25551;&#36848;&#12290;&#23427;&#22312;&#23481;&#38169;&#21644;&#24615;&#33021;&#19978;&#19982;Paxos&#31561;&#25928;&#12290;&#19981;&#21516;&#20043;&#22788;&#22312;&#20110;&#23427;&#34987;&#20998;&#35299;&#20026;&#30456;&#23545;&#29420;&#31435;&#30340;&#23376;&#38382;&#39064;&#65292;&#24182;&#19988;&#24178;&#20928;&#22320;&#35299;&#20915;&#20102;&#23454;&#38469;&#31995;&#32479;&#25152;&#38656;&#30340;&#25152;&#26377;&#20027;&#35201;&#37096;&#20998;&#12290;</p>


<p class="wp-block-paragraph ">Raft&#20316;&#20026;&#22797;&#21046;&#29366;&#24577;&#26426;&#65292;&#26159;&#20998;&#24067;&#24335;&#31995;&#32479;&#20013;&#26368;&#26680;&#24515;&#26368;&#22522;&#30784;&#30340;&#32452;&#20214;&#65292;&#25552;&#20379;&#21629;&#20196;&#22312;&#22810;&#20010;&#33410;&#28857;&#20043;&#38388;&#26377;&#24207;&#22797;&#21046;&#21644;&#25191;&#34892;&#65292;&#24403;&#22810;&#20010;&#33410;&#28857;&#21021;&#22987;&#29366;&#24577;&#19968;&#33268;&#30340;&#26102;&#20505;&#65292;&#20445;&#35777;&#33410;&#28857;&#20043;&#38388;&#29366;&#24577;&#19968;&#33268;&#12290;&#31995;&#32479;&#21482;&#35201;&#22810;&#25968;&#33410;&#28857;&#23384;&#27963;&#23601;&#21487;&#20197;&#27491;&#24120;&#22788;&#29702;&#65292;&#23427;&#20801;&#35768;&#28040;&#24687;&#30340;&#24310;&#36831;&#12289;&#20002;&#24323;&#21644;&#20081;&#24207;&#65292;&#20294;&#26159;&#19981;&#20801;&#35768;&#28040;&#24687;&#30340;&#31713;&#25913;&#65288;&#38750;&#25308;&#21344;&#24237;&#22330;&#26223;&#65289;&#12290;</p>


<h4 class="wp-block-heading wp-block-heading" id="2e38081e5a48de588b6e78ab6e68081e69cba-replicated-state-machine">2&#12289;&#22797;&#21046;&#29366;&#24577;&#26426; (Replicated State Machine)</h4>


<p class="wp-block-paragraph ">&#22797;&#21046;&#29366;&#24577;&#26426;&#23601;&#26159;&#21482;&#35201;&#32473;&#20104;&#20004;&#20010;&#26426;&#22120;&#30456;&#21516;&#30340;&#21021;&#22987;&#29366;&#24577;&#21644;&#36755;&#20837;&#25968;&#25454;&#65292;&#20182;&#20204;&#23601;&#20250;&#24471;&#21040;&#23436;&#20840;&#30456;&#21516;&#30340;&#36755;&#20986;&#24207;&#21015;&#12290;&#32780;Raft&#20849;&#35782;&#31639;&#27861;&#30340;&#30446;&#30340;&#23601;&#26159;&#23454;&#29616;&#19968;&#20010;&#22797;&#21046;&#29366;&#24577;&#26426;&#38598;&#32676;&#65292;&#20445;&#35777;&#27599;&#20010;&#21487;&#29992;&#30340;&#26426;&#22120;&#30340;&#36755;&#20986;&#24207;&#21015;&#26159;&#19968;&#33268;&#30340;&#65292;&#20174;&#32780;&#23454;&#29616;&#25968;&#25454;&#30340;&#39640;&#21487;&#29992;&#24615;&#65292;&#32780;&#22312;&#27492;&#20043;&#19978;&#20063;&#20445;&#35777;&#20102;&#31639;&#27861;&#30340;&#24615;&#33021;&#12290;</p>



<figure class="wp-block-image size-large is-resized"><img decoding="async" fetchpriority="high" src="/wp-content/uploads/2023/08/10802eca1dfdc638ebdef04e4fadd1c5.webp" alt="" class="wp-image-562" width="383" height="301" srcset="/wp-content/uploads/2023/08/10802eca1dfdc638ebdef04e4fadd1c5.webp 646w, /wp-content/uploads/2023/08/10802eca1dfdc638ebdef04e4fadd1c5-300x236.webp 300w" sizes="(max-width: 383px) 100vw, 383px" /></figure>


<h4 class="wp-block-heading wp-block-heading" id="2e38081rafte79a84e4b889e4b8aae5ad90e6a8a1e59d97">2&#12289;Raft&#30340;&#19977;&#20010;&#23376;&#27169;&#22359;</h4>


<h6 class="wp-block-heading wp-block-heading" id="1e38081e9a286e5afbce4babae98089e4b8be">1&#12289;&#39046;&#23548;&#20154;&#36873;&#20030;</h6>


<p class="wp-block-paragraph ">&#39046;&#23548;&#20154;&#26159;raft&#38598;&#32676;&#20013;&#30340;&#26680;&#24515;&#33410;&#28857;&#65292;&#36127;&#36131;&#25972;&#20010;raft&#38598;&#32676;&#23545;&#22806;&#37096;&#35831;&#27714;&#30340;&#21709;&#24212;&#65292;&#20197;&#21450;&#20869;&#37096;&#34892;&#20026;&#30340;&#35843;&#24230;&#65292;&#20855;&#26377;&#21313;&#20998;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#22240;&#27492;&#65292;raft&#38598;&#32676;&#20013;&#30340;&#19968;&#20010;&#20851;&#38190;&#38382;&#39064;&#23601;&#26159;&#65292;&#22914;&#20309;&#23433;&#20840;&#22320;&#36873;&#20030;&#20986;&#19968;&#20010;&#39046;&#23548;&#20154;&#12290;</p>


<p class="wp-block-paragraph ">&#32780;&#36825;&#20010;&#38382;&#39064;&#30340;&#20851;&#38190;&#22312;&#20110;&#65292;&#39318;&#20808;&#35201;&#30693;&#36947;&#65292;&#39046;&#23548;&#20154;&#30340;&#32844;&#36131;&#20197;&#21450;&#23427;&#19982;raft&#30340;&#26085;&#24535;&#30340;&#20851;&#31995;&#65292;&#36825;&#26679;&#25165;&#33021;&#28165;&#26970;&#25105;&#20204;&#21040;&#24213;&#38656;&#35201;&#20160;&#20040;&#26679;&#30340;&#39046;&#23548;&#20154;&#12290;</p>


<p class="wp-block-paragraph ">&#26085;&#24535;&#65306;&#26085;&#24535;&#26159;raft&#20013;&#30340;&#26680;&#24515;&#25968;&#25454;&#21333;&#20803;&#65292;&#21487;&#20197;&#25226;&#23427;&#29702;&#35299;&#20026;raft&#30340;&#20855;&#20307;&#30340;&#25351;&#20196;&#65292;&#20063;&#23601;&#26159;&#25105;&#20204;&#24076;&#26395;raft&#38598;&#32676;&#32479;&#19968;&#21435;&#25191;&#34892;&#30340;&#20219;&#21153;&#12290;</p>


<p class="wp-block-paragraph ">&#36825;&#37324;&#25105;&#20204;&#21435;&#32852;&#24819;&#22797;&#21046;&#29366;&#24577;&#26426;&#30340;&#23450;&#20041;&#65292;&#22797;&#21046;&#29366;&#24577;&#26426;&#26159;&#23545;&#20110;&#19968;&#25972;&#20010;&#38598;&#32676;&#65292;&#36755;&#20837;&#30456;&#21516;&#30340;&#24207;&#21015;&#37117;&#21487;&#20197;&#24471;&#21040;&#30456;&#21516;&#30340;&#36755;&#20986;&#65292;&#25110;&#32773;&#35753;&#38598;&#32676;&#25191;&#34892;&#30456;&#21516;&#30340;&#20219;&#21153;&#65292;&#32780;raft&#20849;&#35782;&#31639;&#27861;&#30340;&#30446;&#30340;&#23601;&#26159;&#23454;&#29616;&#19968;&#20010;&#22797;&#21046;&#29366;&#24577;&#26426;&#38598;&#32676;&#65292;&#37027;&#20040;&#25105;&#20204;&#23601;&#21457;&#29616;&#65292;&#26085;&#24535;&#23601;&#26159;&#25105;&#20204;&#23545;&#20110;&#22797;&#21046;&#29366;&#24577;&#26426;&#38598;&#32676;&#30340;&#36755;&#20837;&#24207;&#21015;&#12290;</p>



<figure class="wp-block-image aligncenter size-large is-resized"><img decoding="async" src="/wp-content/uploads/2023/08/cc0c35f8809325e4f0c9940526313aae.webp" alt="" class="wp-image-554" width="389" height="339" srcset="/wp-content/uploads/2023/08/cc0c35f8809325e4f0c9940526313aae.webp 651w, /wp-content/uploads/2023/08/cc0c35f8809325e4f0c9940526313aae-300x262.webp 300w" sizes="(max-width: 389px) 100vw, 389px" /></figure>


<p class="wp-block-paragraph ">Raft&#30340;&#26085;&#24535;&#24207;&#21015;&#65306;&#27599;&#19968;&#20010;&#26085;&#24535;&#37117;&#26377;&#19968;&#20010;&#21807;&#19968;&#30340;&#32034;&#24341;&#21495;&#65288;&#29702;&#35299;&#20026;&#25968;&#32452;&#30340;&#19979;&#26631;&#65289;&#65292;&#20197;&#21450;&#19968;&#20010;&#20219;&#26399;&#21495;&#65292;&#36890;&#36807;&#36825;&#20004;&#20010;&#25968;&#25454;&#65292;&#25105;&#20204;&#21487;&#20197;&#19981;&#38656;&#35201;&#35835;&#21462;&#26085;&#24535;&#20013;&#30340;&#20855;&#20307;&#30340;&#20869;&#23481;&#21435;&#32479;&#19968;&#30340;&#30830;&#23450;&#19968;&#20010;&#21807;&#19968;&#30340;&#26085;&#24535;&#12290;</p>


<p class="wp-block-paragraph ">&#39046;&#23548;&#20154;&#30340;&#32844;&#36131;&#23601;&#26159;&#65292;&#25226;&#26085;&#24535;&#23433;&#20840;&#30340;&#22797;&#21046;&#21040;&#38598;&#32676;&#20013;&#30340;&#27599;&#19968;&#20010;&#33410;&#28857;&#65292;&#28982;&#21518;&#35753;&#27599;&#19968;&#20010;&#33410;&#28857;&#20998;&#21035;&#24212;&#29992;&#36825;&#20221;&#26085;&#24535;&#65292;&#20174;&#32780;&#25191;&#34892;&#24182;&#36755;&#20986;&#32467;&#26524;&#12290;</p>



<figure class="wp-block-image size-large is-resized"><img decoding="async" src="/wp-content/uploads/2023/08/0f128e7474792903176d513c2b6dc478.webp" alt="" class="wp-image-555" width="381" height="374" srcset="/wp-content/uploads/2023/08/0f128e7474792903176d513c2b6dc478.webp 509w, /wp-content/uploads/2023/08/0f128e7474792903176d513c2b6dc478-300x295.webp 300w" sizes="(max-width: 381px) 100vw, 381px" /></figure>


<p class="wp-block-paragraph ">&#37027;&#20040;&#65292;&#25105;&#20204;&#23601;&#21487;&#20197;&#26469;&#20998;&#26512;&#39046;&#23548;&#20154;&#36873;&#20030;&#30340;&#38382;&#39064;&#65292;&#24038;&#36793;&#36825;&#24352;&#22270;&#23601;&#26159;Raft&#38598;&#32676;&#20013;&#30340;&#19977;&#20010;&#29366;&#24577;</p>


<p class="wp-block-paragraph ">&#32780;&#20219;&#26399;(term)&#65292;&#21017;&#26159;Raft&#20849;&#35782;&#31639;&#27861;&#20013;&#30340;&#26102;&#38388;&#21333;&#20301;&#65292;&#19968;&#20010;&#20219;&#26399;&#21482;&#26159;&#19968;&#20010;&#36923;&#36753;&#26102;&#38388;&#35745;&#25968;&#22120;&#65292;&#32780;&#19981;&#20195;&#34920;&#23454;&#38469;&#30340;&#26102;&#38388;&#30340;&#38271;&#30701;</p>



<figure class="wp-block-image size-full is-resized"><img decoding="async" loading="lazy" src="/wp-content/uploads/2023/08/ff58365b78791a88338511ca81904d2b.webp" alt="" class="wp-image-570" width="496" height="231" srcset="/wp-content/uploads/2023/08/ff58365b78791a88338511ca81904d2b.webp 650w, /wp-content/uploads/2023/08/ff58365b78791a88338511ca81904d2b-300x140.webp 300w" sizes="(max-width: 496px) 100vw, 496px" /></figure>



<figure class="wp-block-image size-large is-resized"><img decoding="async" loading="lazy" src="/wp-content/uploads/2023/08/7804a5a333f8430bbf9e60ab49296490.webp" alt="" class="wp-image-553" width="492" height="192" srcset="/wp-content/uploads/2023/08/7804a5a333f8430bbf9e60ab49296490.webp 542w, /wp-content/uploads/2023/08/7804a5a333f8430bbf9e60ab49296490-300x117.webp 300w" sizes="(max-width: 492px) 100vw, 492px" /></figure>


<p class="wp-block-paragraph ">&#36215;&#21021; &#25152;&#26377;&#30340;&#33410;&#28857;&#37117;&#22788;&#20110;&#36319;&#38543;&#32773;(Follower)&#30340;&#29366;&#24577;&#65292;&#20219;&#26399;&#37117;&#26159;1&#65292;&#27599;&#19968;&#20010;Follower&#37117;&#23384;&#22312;&#19968;&#20010;&#38543;&#26426;&#30340;&#35745;&#26102;&#22120;&#65292;&#22312;&#36825;&#20010;&#38543;&#26426;&#30340;&#35745;&#26102;&#22120;&#30340;&#20498;&#35745;&#26102;&#32467;&#26463;&#21069;&#65292;&#22914;&#26524;&#20182;&#37117;&#27809;&#26377;&#25910;&#21040;&#39046;&#23548;&#20154;(Leader)&#30340;&#24515;&#36339;&#65292;&#20182;&#23601;&#20250;&#35748;&#20026;&#24403;&#21069;&#38598;&#32676;&#26159;&#27809;&#26377;&#39046;&#23548;&#20154;&#30340;&#65292;&#22240;&#27492;&#23601;&#20250;&#36716;&#21464;&#20026;&#20505;&#36873;&#32773;(Candidate)&#29366;&#24577;</p>



<figure class="wp-block-image size-large is-resized"><img decoding="async" loading="lazy" src="/wp-content/uploads/2023/08/0d155f191aec57d8a629d616af3f66d1-1024x605.webp" alt="" class="wp-image-550" width="499" height="294" srcset="/wp-content/uploads/2023/08/0d155f191aec57d8a629d616af3f66d1-1024x605.webp 1024w, /wp-content/uploads/2023/08/0d155f191aec57d8a629d616af3f66d1-300x177.webp 300w, /wp-content/uploads/2023/08/0d155f191aec57d8a629d616af3f66d1-768x454.webp 768w, /wp-content/uploads/2023/08/0d155f191aec57d8a629d616af3f66d1.webp 1194w" sizes="(max-width: 499px) 100vw, 499px" /></figure>


<p class="wp-block-paragraph ">&#22914;&#19979;&#22270;&#65292;S5&#21644;S4&nbsp; &#20004;&#32773;&#21516;&#26102;&#22312;&#38543;&#26426;&#35745;&#26102;&#22120;&#32467;&#26463;&#21518;&#37117;&#27809;&#26377;&#25910;&#21040;&#26469;&#33258;&#39046;&#23548;&#20154;&#30340;&#24515;&#36339;&#65292;&#22240;&#27492;&#20182;&#30340;&#29366;&#24577;&#36716;&#20026;&#20102;&#20505;&#36873;&#32773;&#65292;&#33258;&#36523;&#30340;&#20219;&#26399;&#21495;&#21152;&#19968;&#65292;&#20004;&#32773;&#37117;&#21457;&#36215;&#20102;&#39046;&#23548;&#20154;&#36873;&#20030;(Leader Election)</p>


<p class="wp-block-paragraph ">&#22312;&#27599;&#27425;&#36873;&#20030;&#20013;&#65292;&#27599;&#20010;&#20505;&#36873;&#32773;&#37117;&#20250;&#32473;&#33258;&#24049;&#25237;&#19968;&#31080;&#65292;&#32780;&#25298;&#32477;&#32473;&#20854;&#20182;&#20505;&#36873;&#20154;&#25237;&#31080;&#65292;&#36319;&#38543;&#32773;&#22312;&#19968;&#20010;&#20219;&#26399;&#30340;&#36873;&#20030;&#20013;&#21482;&#33021;&#25353;&#29031;&#20808;&#21040;&#20808;&#24471;&#30340;&#21407;&#21017;&#25237;&#19968;&#31080;</p>


<p class="wp-block-paragraph ">&#24403;&#20505;&#36873;&#20154;&#24471;&#21040;&#20102;&#36229;&#36807;&#38598;&#32676;&#21322;&#25968;&#30340;&#36873;&#31080;&#20197;&#21518;&#65292;&#20182;&#20415;&#21487;&#20197;&#24403;&#36873;Leader</p>


<p class="wp-block-paragraph ">&#32780;&#22914;&#26524;&#22312;&#36825;&#19968;&#36718;&#20219;&#26399;&#30340;&#36873;&#20030;&#20013;&#65292;&#25152;&#26377;&#20505;&#36873;&#20154;&#37117;&#27809;&#26377;&#24471;&#21040;&#36275;&#22815;&#30340;&#36873;&#31080;&#65292;&#37027;&#20040;&#22312;&#35745;&#26102;&#22120;&#36229;&#26102;&#21518;&#65292;&#20505;&#36873;&#20154;&#20250;&#37325;&#32622;&#24471;&#21040;&#30340;&#36873;&#31080;&#65292;&#24182;&#19988;&#23558;&#33258;&#36523;&#30340;&#20219;&#26399;&#21495;&#21152;&#19968;&#65292;&#21457;&#36215;&#19979;&#19968;&#36718;&#20219;&#26399;&#30340;&#36873;&#20030;</p>



<figure class="wp-block-image size-large is-resized"><img decoding="async" loading="lazy" src="/wp-content/uploads/2023/08/56c877394fc7783efbc650a8ed8839b5-1024x643.webp" alt="" class="wp-image-552" width="501" height="321"/></figure>


<p class="wp-block-paragraph ">&#25152;&#35859;&#23433;&#20840;&#24615;&#65292;&#23601;&#26159;&#38450;&#27490;&#19968;&#20010;&#38382;&#39064;&#65292;&#20063;&#23601;&#26159;&#36825;&#20010;&#38598;&#32676;&#20250;&#19981;&#20250;&#20986;&#29616;&#20004;&#20010;&#39046;&#23548;&#20154;&#65292;&#22914;&#26524;&#20986;&#29616;&#20102;&#20004;&#20010;&#39046;&#23548;&#20154;&#35813;&#22914;&#20309;&#38450;&#27490;&#21602;&#65311;</p>



<figure class="wp-block-image size-full is-resized"><img decoding="async" loading="lazy" src="/wp-content/uploads/2023/08/d7a55deeea5e326daa19d34e3fd26114.webp" alt="" class="wp-image-566" width="479" height="300" srcset="/wp-content/uploads/2023/08/d7a55deeea5e326daa19d34e3fd26114.webp 960w, /wp-content/uploads/2023/08/d7a55deeea5e326daa19d34e3fd26114-300x188.webp 300w, /wp-content/uploads/2023/08/d7a55deeea5e326daa19d34e3fd26114-768x482.webp 768w" sizes="(max-width: 479px) 100vw, 479px" /></figure>


<p class="wp-block-paragraph ">&#22312;&#19978;&#22270;&#24773;&#20917;&#19979;&#65292;&#20986;&#29616;&#20102;&#20004;&#20010;&#19981;&#21516;&#20219;&#26399;&#30340;&#20505;&#36873;&#32773;&#65292;&#30001;&#20110;&#27599;&#20010;&#20219;&#26399;&#65292;&#27599;&#20010;&#36319;&#38543;&#30528;&#37117;&#26377;&#19968;&#31080;&#30340;&#25237;&#31080;&#36164;&#26684;&#65292;&#25152;&#20197;S1&#21644;S2&#26159;&#26377;&#21487;&#33021;&#21516;&#26102;&#24471;&#21040;&#36807;&#21322;&#30340;&#36873;&#31080;&#32780;&#25104;&#20026;&#39046;&#23548;&#20154;&#30340;&#65292;&#20294;&#26159;S2&#22914;&#26524;&#21521;S1&#21457;&#25237;&#31080;rpc&#30340;&#35805;&#65292;&#30001;&#20110;S2&#30340;&#20219;&#26399;&#27604;S1&#35201;&#22823;&#65292;S1&#20250;&#39532;&#19978;&#20174;&#20505;&#36873;&#20154;&#29366;&#24577;&#36716;&#21464;&#20026;&#36319;&#38543;&#32773;&#65292;&#24182;&#23558;&#20219;&#26399;&#35843;&#25972;&#20026;4&#65292;&#25110;&#32773;&#35828;&#22914;&#26524;S1&#25104;&#20026;&#20102;&#20219;&#26399;3&#30340;&#39046;&#23548;&#20154;&#65292;&#30001;&#20110;&#25509;&#21040;&#20102;S2&#30340;&#20219;&#26399;4&#30340;rpc&#65292;&#20182;&#20063;&#20250;&#39532;&#19978;&#20174;&#39046;&#23548;&#20154;&#21464;&#22238;&#19968;&#20010;&#36319;&#38543;&#32773;&#12290;</p>



<figure class="wp-block-image size-full is-resized"><img decoding="async" loading="lazy" src="/wp-content/uploads/2023/08/9dfd4cb22d51c3ca7319bc3547e838ef.webp" alt="" class="wp-image-558" width="485" height="300" srcset="/wp-content/uploads/2023/08/9dfd4cb22d51c3ca7319bc3547e838ef.webp 915w, /wp-content/uploads/2023/08/9dfd4cb22d51c3ca7319bc3547e838ef-300x186.webp 300w, /wp-content/uploads/2023/08/9dfd4cb22d51c3ca7319bc3547e838ef-768x476.webp 768w" sizes="(max-width: 485px) 100vw, 485px" /></figure>


<p class="wp-block-paragraph ">&#32780;&#19978;&#22270;&#24773;&#20917;&#19979;&#65292;&#22914;&#26524;S2&#22312;&#20219;&#26399;4&#25285;&#20219;&#39046;&#23548;&#20154;&#65292;&#32780;&#20182;&#21457;&#29983;&#20102;&#32593;&#32476;&#25925;&#38556;&#65292;&#23548;&#33268;&#20182;&#19968;&#30452;&#35748;&#20026;&#33258;&#24049;&#26159;&#20219;&#26399;4&#30340;&#39046;&#23548;&#20154;&#65292;&#32780;S1&#36890;&#36807;&#36229;&#26102;&#65292;&#37325;&#26032;&#36873;&#20030;&#25104;&#20026;&#20102;&#20219;&#26399;5&#30340;&#39046;&#23548;&#20154;&#65292;&#37027;&#20040;&#24403;S2&#32593;&#32476;&#24674;&#22797;&#27491;&#24120;&#20197;&#21518;&#65292;&#20063;&#20250;&#21521;&#20854;&#20182;&#33410;&#28857;&#21457;&#36865;&#24515;&#36339;&#65292;&#32780;&#30001;&#20110;&#20182;&#30340;&#20219;&#26399;&#21495;&#27604;&#36739;&#23567;&#65292;&#25152;&#20197;&#20182;&#20250;&#39532;&#19978;&#20174;&#39046;&#23548;&#20154;&#21464;&#22238;&#36319;&#38543;&#32773;&#12290;</p>


<p class="wp-block-paragraph ">&#36890;&#36807;&#20998;&#26512;&#36873;&#20030;&#30340;&#36807;&#31243;&#65292;&#25105;&#20204;&#21487;&#20197;&#21457;&#29616;&#65292;&#21482;&#35201;&#38598;&#32676;&#20013;&#20173;&#28982;&#23384;&#22312;&#36807;&#21322;&#30340;&#27491;&#24120;&#20114;&#30456;&#36890;&#20449;&#30340;&#33410;&#28857;&#65292;&#25105;&#20204;&#23601;&#20173;&#28982;&#21487;&#20197;&#27491;&#24120;&#36873;&#20030;&#20986;&#39046;&#23548;&#20154;&#65292;&#24182;&#32500;&#25252;&#25972;&#20010;&#38598;&#32676;&#30340;&#27491;&#24120;&#36816;&#34892;&#12290;</p>


<p class="wp-block-paragraph ">&#32780;&#20219;&#26399;&#21495;&#30340;&#38480;&#21046;&#21017;&#20445;&#35777;&#20102;&#22312;&#20219;&#24847;&#19968;&#20010;&#20219;&#26399;&#65292;&#21482;&#20250;&#23384;&#22312;&#19968;&#20010;&#39046;&#23548;&#20154;&#65292;&#36825;&#23601;&#36991;&#20813;&#20102;&#20998;&#24067;&#24335;&#31995;&#32479;&#20013;&#26368;&#26840;&#25163;&#30340;&ldquo;&#33041;&#35010;&rdquo;&#38382;&#39064;&#65288;&#20063;&#23601;&#26159;&#23384;&#22312;&#20004;&#20010;&#31283;&#23450;&#36816;&#34892;&#30340;&#39046;&#23548;&#20154;&#20174;&#32780;&#24178;&#25200;&#20102;&#25972;&#20010;&#38598;&#32676;&#30340;&#27491;&#24120;&#36816;&#20316;&#65289;</p>


<p class="wp-block-paragraph ">&#20294;&#26159;&#65292;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;&#19978;&#36848;&#25552;&#21040;&#30340;&#36873;&#20030;&#26426;&#21046;&#65292;&#26159;&#19981;&#33021;&#22815;&#20445;&#35777;&#38598;&#32676;&#30340;&#25968;&#25454;&#23433;&#20840;&#30340;&#65292;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#21487;&#20197;&#30475;&#21040;&#65292;&#35831;&#27714;&#25237;&#31080;RPC&#20013;&#30340;&#21442;&#25968;&#65292;&#26377;&#19968;&#20010; &#19978;&#19968;&#20010;&#26085;&#24535;&#30340;&#32034;&#24341;&#21495;(lastLogIndex)&#21644; &#19978;&#19968;&#20010;&#26085;&#24535;&#30340;&#20219;&#26399;(lastLogTerm)&#65292;&#36825;&#20004;&#39033;&#21442;&#25968;&#21017;&#26159;&#29992;&#26469;&#20445;&#35777;&#25968;&#25454;&#23433;&#20840;&#30340;&#12290;</p>



<figure class="wp-block-image size-full"><img decoding="async" loading="lazy" width="485" height="606" src="/wp-content/uploads/2023/08/71801f8477cadb6fba07c7aec7d06e81-1.webp" alt="" class="wp-image-571" srcset="/wp-content/uploads/2023/08/71801f8477cadb6fba07c7aec7d06e81-1.webp 485w, /wp-content/uploads/2023/08/71801f8477cadb6fba07c7aec7d06e81-1-240x300.webp 240w" sizes="(max-width: 485px) 100vw, 485px" /></figure>


<p class="wp-block-paragraph ">&#25105;&#20204;&#21069;&#38754;&#20063;&#25552;&#21040;&#36807;&#65292;&#24403;&#19968;&#20010;&#33410;&#28857;&#25104;&#20026;&#39046;&#23548;&#20154;&#21518;&#65292;&#20182;&#38656;&#35201;&#23558;&#33258;&#24049;&#30340;&#26085;&#24535;&#65292;&#22797;&#21046;&#21040;&#20854;&#20182;&#30340;&#36319;&#38543;&#32773;&#33410;&#28857;&#65292;&#32780;&#36825;&#65292;&#27491;&#26159;&#22797;&#21046;&#29366;&#24577;&#26426;&#30340;&#23454;&#29616;&#20851;&#38190;&#65292;&#21482;&#35201;&#39046;&#23548;&#20154;&#23558;&#33258;&#24049;&#30340;&#26085;&#24535;&#37117;&#27491;&#30830;&#65292;&#23433;&#20840;&#22320;&#22797;&#21046;&#21040;&#20102;&#36319;&#38543;&#32773;&#33410;&#28857;&#65292;&#37027;&#20040;&#26159;&#19981;&#26159;&#23601;&#24847;&#21619;&#30528;&#65292;&#19981;&#31649;&#25105;&#20204;&#22806;&#37096;&#21521;&#20219;&#24847;&#19968;&#20010;&#38598;&#32676;&#21457;&#36215;&#25351;&#20196;&#35831;&#27714;&#65292;&#20182;&#37117;&#20250;&#24110;&#21161;&#25105;&#20204;&#25214;&#21040;&#39046;&#23548;&#20154;&#65292;&#32780;&#39046;&#23548;&#20154;&#20250;&#24110;&#25105;&#20204;&#23558;&#35813;&#35831;&#27714;&#30340;&#26085;&#24535;&#20449;&#24687;&#37117;&#22797;&#21046;&#21040;&#25152;&#26377;&#30340;&#33410;&#28857;&#65292;&#24182;&#25191;&#34892;&#26085;&#24535;&#30340;&#35831;&#27714;&#65292;&#25152;&#20197;&#26080;&#35770;&#25105;&#20204;&#21521;&#38598;&#32676;&#30340;&#20219;&#24847;&#30340;&#33410;&#28857;&#21457;&#36215;&#36755;&#20837;&#65292;&#26368;&#32456;&#24471;&#21040;&#30340;&#36755;&#20986;&#26159;&#19981;&#26159;&#37117;&#26159;&#19968;&#33268;&#30340;&#21602;</p>


<p class="wp-block-paragraph ">&#24403;&#28982;&#65292;&#30446;&#21069;&#25105;&#20204;&#25552;&#21450;&#30340;Raft&#20849;&#35782;&#31639;&#27861;&#30340;&#35268;&#21017;&#36824;&#19981;&#36275;&#20197;&#20445;&#35777;&#32477;&#23545;&#30340;&#23433;&#20840;&#24615;&#65292;&#25105;&#20204;&#36824;&#38656;&#35201;&#32487;&#32493;&#20998;&#26512;&#36825;&#20010;&#31639;&#27861;</p>



<figure class="wp-block-image size-full"><img decoding="async" loading="lazy" width="687" height="600" src="/wp-content/uploads/2023/08/32deebc8eda13078ce4844991fe21bd5.webp" alt="" class="wp-image-559" srcset="/wp-content/uploads/2023/08/32deebc8eda13078ce4844991fe21bd5.webp 687w, /wp-content/uploads/2023/08/32deebc8eda13078ce4844991fe21bd5-300x262.webp 300w" sizes="(max-width: 687px) 100vw, 687px" /></figure>


<p class="wp-block-paragraph ">&#39318;&#20808;&#25105;&#20204;&#26469;&#30475;&#19968;&#19979; &#26085;&#24535;&#36861;&#21152;RPC(Append Entries RPC)&#65292;&#36825;&#23601;&#26159;Raft&#38598;&#32676;&#30340;&#39046;&#23548;&#20154;&#20250;&#21521;&#27599;&#20010;&#33410;&#28857;&#21457;&#36215;&#30340;&#24515;&#36339;&#65292;&#22312;&#39046;&#23548;&#20154;&#36873;&#20030;&#30340;&#20998;&#26512;&#20013;&#25105;&#20204;&#20063;&#25552;&#21040;&#36807;&#65292;&#21482;&#35201;&#38598;&#32676;&#20013;&#30340;&#33410;&#28857;&#25910;&#21040;&#20102;&#36825;&#20010;&#24515;&#36339;&#65292;&#37027;&#20040;&#20182;&#22312;&#38543;&#26426;&#36229;&#26102;&#32467;&#26463;&#21518;&#65292;&#23601;&#19981;&#20250;&#36716;&#21464;&#20026;&#36319;&#38543;&#32773;&#12290;</p>


<p class="wp-block-paragraph ">&#38598;&#32676;&#20013;&#30340;&#36319;&#38543;&#32773;&#22312;&#25910;&#21040;&#20102;&#26085;&#24535;&#36861;&#21152;RPC&#20197;&#21518;&#65292;&#20250;&#23558;&#39046;&#23548;&#20154;&#21457;&#36807;&#26469;&#30340;&#26085;&#24535;(entries[]&#21442;&#25968;)&#22797;&#21046;&#21040;&#33258;&#24049;&#30340;&#33410;&#28857;&#65292;&#22797;&#21046;&#23436;&#25104;&#20197;&#21518;&#20250;&#36820;&#22238;success&#29366;&#24577;&#32473;&#39046;&#23548;&#20154;&#65292;&#34920;&#26126;&#33258;&#24049;&#23436;&#25104;&#20102;&#22797;&#21046;&#20219;&#21153;&#12290;</p>


<p class="wp-block-paragraph ">&#32780;&#39046;&#23548;&#20154;&#22312;&#25910;&#21040;&#36807;&#21322;&#30340;&#25104;&#21151;&#30340;&#31572;&#22797;&#21518;&#65292;&#23601;&#20250;&#24320;&#22987;&#23581;&#35797;&#25552;&#20132;&#24403;&#21069;&#30340;&#26085;&#24535;&#65292;&#28982;&#21518;&#23558;&#32467;&#26524;&#36820;&#22238;&#32473;&#23458;&#25143;&#31471;&#65292;&#34920;&#26126;&#33258;&#24049;&#24050;&#32463;&#25191;&#34892;&#20102;&#36825;&#20010;&#25351;&#20196;&#12290;</p>


<p class="wp-block-paragraph ">&#22823;&#23478;&#21487;&#20197;&#35774;&#24819;&#65292;&#36825;&#20010;&#26085;&#24535;&#22797;&#21046;&#26159;&#19981;&#26159;&#26080;&#26465;&#20214;&#30340;&#21602;&#65311;&#24403;&#28982;&#19981;&#26159;&#65292;&#25105;&#20204;&#26469;&#30475;&#19979;&#38754;&#30340;&#19968;&#20010;&#22330;&#26223;&#65292;&#20174;&#32780;&#35299;&#26512; prevLogIndex&#21644;prevLogTerm&#20004;&#20010;&#21442;&#25968;&#30340;&#20316;&#29992;&#12290;</p>



<div class="wp-block-columns is-stacked-on-mobile is-layout-flex wp-container-3 wp-block-columns is-stacked-on-mobile-is-layout-flex">
<div class="wp-block-column is-layout-flow wp-block-column-is-layout-flow" style="flex-basis:100%">
<figure class="wp-block-image size-large"><img decoding="async" loading="lazy" width="1024" height="574" src="/wp-content/uploads/2023/08/ad7b993145b08bae99cf037576ca54fa-1024x574.webp" alt="" class="wp-image-564" srcset="/wp-content/uploads/2023/08/ad7b993145b08bae99cf037576ca54fa-1024x574.webp 1024w, /wp-content/uploads/2023/08/ad7b993145b08bae99cf037576ca54fa-300x168.webp 300w, /wp-content/uploads/2023/08/ad7b993145b08bae99cf037576ca54fa-768x430.webp 768w, /wp-content/uploads/2023/08/ad7b993145b08bae99cf037576ca54fa.webp 1207w" sizes="(max-width: 1024px) 100vw, 1024px" /></figure>
</div>



<div class="wp-block-column is-layout-flow wp-block-column-is-layout-flow" style="flex-basis:100%">
<figure class="wp-block-image size-large"><img decoding="async" loading="lazy" width="1024" height="608" src="/wp-content/uploads/2023/08/5b70b31841fa4f239000a719b8a55762-1024x608.webp" alt="" class="wp-image-556" srcset="/wp-content/uploads/2023/08/5b70b31841fa4f239000a719b8a55762-1024x608.webp 1024w, /wp-content/uploads/2023/08/5b70b31841fa4f239000a719b8a55762-300x178.webp 300w, /wp-content/uploads/2023/08/5b70b31841fa4f239000a719b8a55762-768x456.webp 768w, /wp-content/uploads/2023/08/5b70b31841fa4f239000a719b8a55762.webp 1104w" sizes="(max-width: 1024px) 100vw, 1024px" /></figure>
</div>
</div>


<p class="wp-block-paragraph ">&#22312;&#19978;&#36793;&#30340;&#24773;&#20917;&#65292;S1&#26426;&#22120;&#26159;&#24403;&#21069;&#20219;&#26399;4&#30340;&#39046;&#23548;&#20154;&#65292;&#32780;S2&#26426;&#22120;&#30001;&#20110;&#20808;&#21069;&#21457;&#29983;&#20102;&#23849;&#28291;&#65292;&#21018;&#21018;&#24674;&#22797;&#65292;&#23548;&#33268;&#20182;&#32570;&#22833;&#20102;&#36825;&#20010;&#20219;&#26399;&#19981;&#23569;&#30340;&#26085;&#24535;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#38598;&#32676;&#20013;&#30340;&#26426;&#22120;&#23601;&#20986;&#29616;&#20102;&#26085;&#24535;&#19981;&#19968;&#33268;&#30340;&#24773;&#20917;&#12290;</p>


<p class="wp-block-paragraph ">&#22240;&#27492;&#65292;&#22312;&#21457;&#36865;&#24515;&#36339;&#30340;&#26102;&#20505;&#65292;S1&#20250;&#21152;&#19978;&#33258;&#24049;&#30340;&#19978;&#19968;&#20010;&#26085;&#24535;&#30340;&#20219;&#26399;&#21495;&#21644;&#19978;&#19968;&#20010;&#26085;&#24535;&#30340;&#32034;&#24341;&#21495;&#65292;&#32780;&#36319;&#38543;&#32773;S5&#20250;&#23545;&#27492;&#25191;&#34892;<strong>&#19968;&#33268;&#24615;&#26816;&#26597;</strong>&#65292;&#20063;&#23601;&#26159;&#20250;&#26816;&#26597;S1&#30340;&#19978;&#19968;&#20010;&#26085;&#24535;&#30340;&#20219;&#26399;&#21495;&#21644;&#32034;&#24341;&#21495;&#65292;&#26159;&#21542;&#36319;&#33258;&#24049;&#30340;&#19978;&#19968;&#20010;&#26085;&#24535;&#30340;&#20219;&#26399;&#21495;&#21644;&#32034;&#24341;&#21495;&#19968;&#33268;&#65292;&#20551;&#22914;&#20004;&#32773;&#19968;&#33268;&#65292;&#37027;&#20040;&#23601;&#35828;&#26126;&#22312;&#36825;&#20010;&#32034;&#24341;&#21495;&#21069;&#30340;S5&#21644;S1&#30340;&#26085;&#24535;&#26159;&#19968;&#26679;&#30340;&#65292;&#28982;&#21518;&#23601;&#21487;&#20197;&#25226;&#26085;&#24535;&#23433;&#20840;&#22320;&#22797;&#21046;&#21040;&#33258;&#24049;&#30340;&#26426;&#22120;&#19978;&#65292;&#20294;&#26159;&#22270;&#20013;&#30340;&#36825;&#31181;&#24773;&#20917;&#26159;&#26174;&#28982;&#19981;&#19968;&#33268;&#30340;&#65292;&#25152;&#20197;&#31532;&#19968;&#27425;rpc&#20250;&#21457;&#36865;&#32034;&#24341;6&#65292;&#32780;&#31532;&#20108;&#27425;rpc&#23601;&#20250;&#21457;&#36865;&#32034;&#24341;5&#65292;&#20174;&#32780;&#19968;&#28857;&#19968;&#28857;&#24448;&#21069;&#22238;&#28335;&#65292;&#21435;&#25214;&#21040;&#21452;&#26041;&#26085;&#24535;&#24207;&#21015;&#26368;&#21518;&#30456;&#21516;&#30340;&#22320;&#26041;&#12290;</p>


<p class="wp-block-paragraph ">&#36825;&#23601;&#26159; prevLogIndex&#21644;prevLogTerm&#30340;&#20316;&#29992;&#65292;&#36890;&#36807;&#36825;&#20004;&#20010;&#21442;&#25968;&#20197;&#21450;&#19968;&#33268;&#24615;&#26816;&#26597;&#26426;&#21046;&#65292;raft&#38598;&#32676;&#24471;&#20197;&#20445;&#38556;&#21508;&#20010;&#26426;&#22120;&#19978;&#30340;&#25968;&#25454;&#30340;&#19968;&#33268;&#24615;&#12290;</p>


<p class="wp-block-paragraph ">&#22312;&#25214;&#21040;&#21452;&#26041;&#26368;&#21518;&#30456;&#21516;&#30340;&#26085;&#24535;&#20197;&#21518;&#65292;&#65292;&#23601;&#20687;&#21491;&#22270;&#19968;&#26679;&#65292;S5&#23601;&#21487;&#20197;&#25226;S1&#21457;&#36807;&#26469;&#30340;&#26085;&#24535;&#30452;&#25509;&#22797;&#21046;&#19979;&#26469;&#65292;&#37027;&#20040;&#19968;&#27425;&#26085;&#24535;&#36861;&#21152;&#30340;&#20219;&#21153;&#23601;&#31639;&#25104;&#21151;&#23436;&#25104;&#20102;&#12290;</p>


<h6 class="wp-block-heading wp-block-heading" id="e697a5e5bf97e68f90e4baa4"><strong>&#26085;&#24535;&#25552;&#20132;</strong></h6>


<p class="wp-block-paragraph ">&#25105;&#20204;&#21069;&#38754;&#20063;&#25552;&#21040;&#20102;&#65292;&#39046;&#23548;&#20154;&#22312;&#25104;&#21151;&#22320;&#23558;&#19968;&#39033;&#26085;&#24535;&#22797;&#21046;&#21040;&#36807;&#21322;&#30340;&#33410;&#28857;&#20197;&#21518;&#65292;&#23601;&#21487;&#20197;&#25191;&#34892;&#25552;&#20132;&#20102;&#65292;&#25191;&#34892;&#20102;&#25552;&#20132;&#20063;&#23601;&#24847;&#21619;&#30528;&#36825;&#20010;&#32467;&#26524;&#21487;&#20197;&#36820;&#22238;&#32473;&#23458;&#25143;&#31471;&#20102;&#12290;</p>


<p class="wp-block-paragraph ">&#21487;&#26159;&#20174;&#26085;&#24535;&#22797;&#21046;&#65292;&#21040;&#26085;&#24535;&#25552;&#20132;&#65292;&#20877;&#21040;&#39046;&#23548;&#20154;&#23558;&#25552;&#20132;&#30340;&#32467;&#26524;&#36890;&#36807;&#24515;&#36339;&#21578;&#30693;&#21508;&#20010;&#36319;&#38543;&#32773;&#33410;&#28857;&#65292;&#37117;&#26159;&#38656;&#35201;&#26102;&#38388;&#30340;&#65292;&#36825;&#20013;&#38388;&#22914;&#26524;&#39046;&#23548;&#20154;&#25110;&#32773;&#26576;&#20010;&#36319;&#38543;&#32773;&#21457;&#29983;&#20102;&#23849;&#28291;&#65292;&#38590;&#36947;&#19981;&#20250;&#23548;&#33268;&#21508;&#20010;&#26426;&#22120;&#30340;&#19981;&#19968;&#33268;&#30340;&#24773;&#20917;&#21527;&#65311;</p>


<p class="wp-block-paragraph ">&#25105;&#20204;&#30446;&#21069;&#30340;&#26085;&#24535;&#22797;&#21046;&#35268;&#21017;&#20173;&#28982;&#26377;&#19968;&#20123;&#28431;&#27934;&#65292;&#20250;&#23548;&#33268;&#21508;&#20010;&#33410;&#28857;&#20013;&#30340;&#26085;&#24535;&#19981;&#19968;&#33268;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#19979;&#38754;&#20174;&#19968;&#20010;&#36873;&#20030;&#22330;&#26223;&#21435;&#20837;&#25163;&#12290;</p>


<p class="wp-block-paragraph ">&#22312;&#35299;&#26512;&#39046;&#23548;&#20154;&#36873;&#20030;&#30340;&#35268;&#21017;&#20013;&#65292;&#25105;&#20204;&#25552;&#21040;&#20102;&#19968;&#20214;&#20107;&#65292;&#22312;&#20043;&#21069;&#30340;&#39046;&#23548;&#20154;&#36873;&#20030;&#30340;&#35268;&#21017;&#20013;&#65292;&#26159;&#19981;&#36275;&#20197;&#20445;&#35777;&#21508;&#20010;&#26426;&#22120;&#30340;&#25968;&#25454;&#30340;&#19968;&#33268;&#24615;&#30340;&#65292;&#27604;&#22914;&#19979;&#38754;&#36825;&#20010;&#22330;&#26223;</p>



<figure class="wp-block-image size-full"><img decoding="async" loading="lazy" width="565" height="545" src="/wp-content/uploads/2023/08/2419e5c9bd6b74b72511fabee68d66d8.webp" alt="" class="wp-image-561" srcset="/wp-content/uploads/2023/08/2419e5c9bd6b74b72511fabee68d66d8.webp 565w, /wp-content/uploads/2023/08/2419e5c9bd6b74b72511fabee68d66d8-300x289.webp 300w" sizes="(max-width: 565px) 100vw, 565px" /></figure>


<p class="wp-block-paragraph ">&#36825;&#37324;&#65292;&#30001;&#20110;&#38598;&#32676;&#30340;&#26576;&#20123;&#26426;&#22120;&#21457;&#29983;&#20102;&#22810;&#27425;&#30340;&#23849;&#28291;&#21644;&#37325;&#21551;&#65292;&#23548;&#33268;&#21508;&#20010;&#33410;&#28857;&#30340;&#26085;&#24535;&#20986;&#29616;&#20102;&#21508;&#31181;&#19981;&#19968;&#33268;&#30340;&#24773;&#20917;&#12290;</p>


<p class="wp-block-paragraph ">&#37027;&#20040;&#25105;&#20204;&#26469;&#20998;&#26512;&#19968;&#19979;&#65292;&#20551;&#22914;&#22312;&#36825;&#20010;&#22330;&#26223;&#19979;&#65292;&#26159;&#19981;&#26159;&#25152;&#26377;&#30340;&#26426;&#22120;&#37117;&#33021;&#22815;&#24403;&#36873;&#39046;&#23548;&#20154;&#21602;&#65311;</p>


<p class="wp-block-paragraph ">&#25105;&#20204;&#21487;&#20197;&#30475;&#21040;&#65292;&#29616;&#22312;&#32034;&#24341;4 5 6 7 8 9&#30340;&#26085;&#24535;&#37117;&#24050;&#32463;&#34987;&#22797;&#21046;&#21040;&#20102;&#36807;&#21322;&#30340;&#33410;&#28857;&#65292;&#25152;&#20197;&#20182;&#20204;&#24212;&#35813;&#20063;&#24050;&#32463;&#27491;&#30830;&#22320;&#25552;&#20132;&#19978;&#21435;&#20102;&#25165;&#23545;&#12290;</p>


<p class="wp-block-paragraph ">&#37027;&#20040;&#22914;&#26524;f&#22312;&#36825;&#26102;&#20505;&#24403;&#36873;&#20102;&#39046;&#23548;&#20154;&#65292;&#20250;&#21457;&#29983;&#20160;&#20040;&#21518;&#26524;&#21602;&#65311;</p>


<p class="wp-block-paragraph ">f&#33410;&#28857;&#36319;&#20854;&#20182;&#26426;&#22120;&#30340;&#26368;&#21518;&#30456;&#21516;&#30340;&#26085;&#24535;&#26159;&#32034;&#24341;3&#30340;&#26085;&#24535;&#65292;&#36825;&#23601;&#24847;&#21619;&#30528;&#23427;&#20250;&#23558;&#33258;&#24049;&#30340;&#32034;&#24341;4&#21040;9&#30340;&#26085;&#24535;&#20840;&#37096;&#35206;&#30422;&#21040;&#20854;&#20182;&#30340;&#33410;&#28857;&#65292;&#37027;&#20040;&#25105;&#20204;&#24050;&#32463;&#27491;&#30830;&#25552;&#20132;&#30340;&#26085;&#24535;&#23601;&#34987;&#35206;&#30422;&#20102;&#65281;&#36825;&#26159;&#38750;&#24120;&#21361;&#38505;&#30340;&#34892;&#20026;&#12290;</p>


<p class="wp-block-paragraph ">&#22240;&#20026;&#22312;&#20849;&#35782;&#31639;&#27861;&#37324;&#38754;&#65292;&#25552;&#20132;&#23601;&#20195;&#34920;&#30528;&#25105;&#20204;&#30340;&#38598;&#32676;&#24050;&#32463;&#23545;&#36825;&#19968;&#20010;&#26085;&#24535;&#36798;&#25104;&#20102;&#20849;&#35782;&#65292;&#36825;&#26102;&#20505;&#22914;&#26524;&#25226;&#24050;&#32463;&#25552;&#20132;&#30340;&#26085;&#24535;&#35206;&#30422;&#65292;&#37027;&#23601;&#26159;&#23558;&#36798;&#25104;&#30340;&#20849;&#35782;&#25764;&#38144;&#20102;&#65292;&#32780;&#20849;&#35782;&#31639;&#27861;&#30340;&#35774;&#35745;&#30446;&#30340;&#23601;&#26159;&#19981;&#33021;&#22815;&#25764;&#38144;&#24050;&#36798;&#25104;&#30340;&#20849;&#35782;&#65292;&#22240;&#27492;&#65292;&#36825;&#26679;&#30340;&#36873;&#20030;&#26080;&#30097;&#26159;&#20005;&#37325;&#30340;&#24433;&#21709;&#23433;&#20840;&#24615;&#30340;&#65281;</p>


<p class="wp-block-paragraph ">&#37027;&#20040;&#25105;&#20204;&#22238;&#36807;&#22836;&#26469;&#30475;&#65292;&#35831;&#27714;&#25237;&#31080;&#30340;RPC&#30340;&#20004;&#20010;&#21442;&#25968;&#65292;&#27491;&#26159;&#29992;&#26469;&#20445;&#35777;&#23433;&#20840;&#24615;&#32780;&#20570;&#20986;&#30340;&#36873;&#20030;&#38480;&#21046;&#12290;</p>



<figure class="wp-block-image size-full"><img decoding="async" loading="lazy" width="527" height="392" src="/wp-content/uploads/2023/08/bf65d3270f106c75412338bb13448383.webp" alt="" class="wp-image-565" srcset="/wp-content/uploads/2023/08/bf65d3270f106c75412338bb13448383.webp 527w, /wp-content/uploads/2023/08/bf65d3270f106c75412338bb13448383-300x223.webp 300w" sizes="(max-width: 527px) 100vw, 527px" /></figure>


<p class="wp-block-paragraph ">&#27599;&#20010;&#20505;&#36873;&#32773;&#22312;&#21457;&#20986;&#36873;&#20030;&#25237;&#31080;&#30340;RPC&#30340;&#26102;&#20505;&#65292;&#37117;&#20250;&#25658;&#24102;&#20182;&#26368;&#21518;&#19968;&#39033;&#26085;&#24535;&#30340;&#20219;&#26399;&#21495;&#21644;&#32034;&#24341;&#21495;(lastLogIndex and lastLogTerm)&#65292;&#32780;&#27599;&#20010;&#25910;&#21040;rpc&#30340;&#36319;&#38543;&#32773;&#37117;&#20250;&#23558;&#20182;&#19982;&#33258;&#24049;&#30340;&#26368;&#21518;&#19968;&#39033;&#26085;&#24535;&#30340;&#20219;&#26399;&#21495;&#21644;&#32034;&#24341;&#21495;&#27604;&#23545;&#65292;&#22914;&#26524;&#25910;&#21040;&#30340;rpc&#30340;&#26368;&#21518;&#26085;&#24535;&#20219;&#26399;&#21495;&#27604;&#33258;&#24049;&#30340;&#23567;&#65292;&#25110;&#32773;&#22914;&#26524;&#20219;&#26399;&#21495;&#30456;&#21516;&#65292;&#20294;&#26159;&#26085;&#24535;&#30340;&#32034;&#24341;&#21495;&#27604;&#36739;&#23567;&#65292;&#37027;&#20040;&#37117;&#35828;&#26126;&#20182;&#25152;&#20855;&#22791;&#30340;&#26085;&#24535;&#30456;&#27604;&#20110;&#33258;&#24049;&#20855;&#22791;&#30340;&#26085;&#24535;&#26159;&#36807;&#26399;&#30340;&#65292;&#37027;&#20040;&#20182;&#23601;&#20250;&#25298;&#32477;&#25237;&#31080;&#12290;</p>


<p class="wp-block-paragraph ">&#37027;&#20040;&#22823;&#23478;&#21487;&#33021;&#26377;&#30097;&#38382;&#65292;&#36825;&#37324;c&#26426;&#22120;&#21644;d&#26426;&#22120;&#25152;&#25317;&#26377;&#30340;&#26085;&#24535;&#26159;&#26368;&#26032;&#30340;&#65292;&#20026;&#20160;&#20040;&#24182;&#27809;&#26377;&#20855;&#22791;&#26368;&#26032;&#26085;&#24535;&#30340;&#26426;&#22120;&#65288;&#24403;&#21069;&#39046;&#23548;&#20154;&#65289;&#33021;&#22815;&#24403;&#36873;&#39046;&#23548;&#20154;&#21602;&#65311;&#25105;&#20204;&#20197;&#27492;&#26469;&#20998;&#26512;&#19968;&#19979;&#24038;&#22270;&#30340;&#24773;&#20917;&#65292;&#34429;&#28982;d&#26426;&#22120;&#25317;&#26377;&#30340;&#26085;&#24535;&#26159;&#26368;&#26032;&#30340;&#65292;&#20294;&#26159;&#20182;&#24182;&#27809;&#26377;&#25104;&#21151;&#22320;&#23558;&#26426;&#22120;&#22797;&#21046;&#21040;&#36807;&#21322;&#25968;&#30340;&#33410;&#28857;&#65292;&#25152;&#20197;&#25105;&#20204;&#24403;&#21069;&#30340;&#39046;&#23548;&#20154;&#36873;&#20030;&#30340;&#26102;&#20505;&#23601;&#21487;&#20197;&#20973;&#20511;&#36825;&#20010;&#35268;&#21017;&#25104;&#21151;&#33719;&#21462;&#21040;a b e f&#30340;&#36873;&#31080;&#65292;&#37027;&#20040;&#20063;&#26159;&#36229;&#36807;&#21322;&#25968;&#30340;&#65292;&#20063;&#33021;&#22815;&#25104;&#21151;&#24403;&#36873;&#39046;&#23548;&#20154;&#65292;&#32780;&#22312;&#24403;&#36873;&#39046;&#23548;&#20154;&#20197;&#21518;&#65292;&#21363;&#20351;c&#26426;&#22120;&#21644;d&#26426;&#22120;&#25317;&#26377;&#30340;&#26085;&#24535;&#27604;&#36739;&#26032;&#65292;&#37027;&#20063;&#27809;&#26377;&#20851;&#31995;&#65292;&#22240;&#20026;&#20182;&#20204;&#27809;&#26377;&#23558;&#36825;&#20221;&#26085;&#24535;&#22797;&#21046;&#21040;&#36807;&#21322;&#33410;&#28857;&#65292;&#25152;&#20197;&#20063;&#23601;&#27809;&#26377;&#25552;&#20132;&#65292;&#37027;&#20040;&#23558;&#36825;&#20123;&#26085;&#24535;&#35206;&#30422;&#20102;&#20063;&#26159;&#27809;&#26377;&#20851;&#31995;&#30340;&#12290;</p>



<figure class="wp-block-image size-full"><img decoding="async" loading="lazy" width="571" height="584" src="/wp-content/uploads/2023/08/f743bcc7b4f52b4106d1a7fb378b7580.webp" alt="" class="wp-image-567" srcset="/wp-content/uploads/2023/08/f743bcc7b4f52b4106d1a7fb378b7580.webp 571w, /wp-content/uploads/2023/08/f743bcc7b4f52b4106d1a7fb378b7580-293x300.webp 293w" sizes="(max-width: 571px) 100vw, 571px" /></figure>


<p class="wp-block-paragraph ">&#20851;&#20110;raft&#30340;&#23433;&#20840;&#24615;&#38382;&#39064;&#65292;&#25105;&#20204;&#36824;&#26377;&#19968;&#20010;&#38382;&#39064;&#27809;&#26377;&#35299;&#20915;&#65292;&#25105;&#20204;&#35828;&#65292;&#39046;&#23548;&#20154;&#23558;&#19968;&#39033;&#26085;&#24535;&#22797;&#21046;&#21040;&#36807;&#21322;&#30340;&#33410;&#28857;&#21518;&#65292;&#23601;&#21487;&#20197;&#25191;&#34892;&#25552;&#20132;&#20102;&#65292;&#37027;&#20040;&#26159;&#19981;&#26159;&#32477;&#23545;&#22914;&#27492;&#21602;&#65311;&#25105;&#20204;&#26469;&#30475;&#19978;&#36793;&#36825;&#26679;&#19968;&#31181;&#24773;&#20917;&#65306;</p>


<p class="wp-block-paragraph ">S1&#22312;&#20219;&#26399;2&#24403;&#36873;&#39046;&#23548;&#20154;&#65292;&#28982;&#21518;&#21457;&#29983;&#20102;&#23849;&#28291;&#65292;&#32780;S5&#22312;&#20219;&#26399;3&#24403;&#36873;&#20102;&#39046;&#23548;&#20154;&#65292;&#32780;S5&#21448;&#21457;&#29983;&#20102;&#23849;&#28291;&#65292;S1&#22312;&#20219;&#26399;4&#20877;&#27425;&#24403;&#36873;&#20102;&#39046;&#23548;&#20154;</p>


<p class="wp-block-paragraph ">&#36825;&#26102;&#20505;&#65292;S1&#20250;&#25353;&#29031;&#35268;&#21017;&#65292;&#20808;&#23558;&#20219;&#26399;2&#30340;&#26085;&#24535;&#22797;&#21046;&#21040;&#36807;&#21322;&#30340;&#26426;&#22120;&#19978;&#65292;&#37027;&#20040;&#65292;&#36825;&#20010;&#26102;&#20505;&#65292;&#23601;&#21487;&#20197;&#25552;&#20132;&#20102;&#21527;&#65311;&#37027;&#20040;&#20551;&#22914;&#25105;&#20204;&#22312;&#27492;&#26102;&#25552;&#20132;&#20102;&#26085;&#24535;2&#65292;&#20250;&#21457;&#29983;&#20160;&#20040;&#21518;&#26524;&#21602;&#65311;</p>


<p class="wp-block-paragraph ">&#25105;&#20204;&#25509;&#19979;&#26469;&#30475;&#22270;d&#65292;S1&#22312;&#23558;&#20219;&#26399;2&#30340;&#26085;&#24535;&#22797;&#21046;&#21040;&#21508;&#20010;&#26426;&#22120;&#19978;&#38754;&#20197;&#21518;&#65292;&#32467;&#26524;S1&#20877;&#27425;&#21457;&#29983;&#20102;&#23849;&#28291;&#65292;S5&#20877;&#27425;&#25285;&#20219;&#20102;&#39046;&#23548;&#65292;&#37027;&#20040;&#20182;&#20063;&#20250;&#23558;&#32034;&#24341;2 &#20219;&#26399;3&#30340;&#26085;&#24535;&#22797;&#21046;&#21040;&#21508;&#20010;&#26426;&#22120;&#19978;&#65292;&#36825;&#23601;&#25226;&#26085;&#24535;2&#35206;&#30422;&#20102;&#65281;</p>


<p class="wp-block-paragraph ">&#25152;&#20197;&#25105;&#20204;&#38656;&#35201;&#21152;&#19968;&#26465;&#38480;&#21046;&#65292;&#37027;&#23601;&#26159;&#65292;&#19968;&#20010;&#26426;&#22120;&#21482;&#33021;&#25552;&#20132;&#24403;&#21069;&#20219;&#26399;&#30340;&#26085;&#24535;&#65292;&#32769;&#26085;&#24535;&#20250;&#38543;&#30528;&#24403;&#21069;&#20219;&#26399;&#30340;&#26085;&#24535;&#30340;&#25552;&#20132;&#19968;&#24182;&#25552;&#20132;&#12290;</p>


<p class="wp-block-paragraph ">&#21152;&#19978;&#36825;&#26465;&#38480;&#21046;&#20197;&#21518;&#65292;&#20551;&#22914;&#21040;&#20102;&#22270;e&#30340;&#22330;&#26223;&#65292;&#20551;&#22914;&#20219;&#26399;4&#30340;&#39046;&#23548;&#20154;S1&#22312;&#25552;&#20132;&#20102;&#32034;&#24341;3&#20219;&#26399;4&#30340;&#26085;&#24535;&#21518;&#20877;&#27425;&#21457;&#29983;&#20102;&#23849;&#28291;&#65292;S5&#20063;&#20250;&#30001;&#20110;&#36873;&#20030;&#30340;&#38480;&#21046;&#65288;&#32034;&#24341;&#21644;&#20219;&#26399;&#65289;&#32780;&#26080;&#27861;&#24403;&#36873;&#39046;&#23548;&#20154;&#65292;&#20174;&#32780;&#20063;&#19981;&#20250;&#21457;&#29983;&#24050;&#25552;&#20132;&#30340;&#26085;&#24535;&#34987;&#35206;&#30422;&#30340;&#24773;&#20917;&#12290;</p>


<h6 class="wp-block-heading wp-block-heading" id="e5ae89e585a8e680a7"><strong>&#23433;&#20840;&#24615;</strong></h6>


<p class="wp-block-paragraph ">&#23454;&#38469;&#19978;&#65292;Raft&#30340;&#31532;&#19977;&#20010;&#23376;&#27169;&#22359;&mdash;&mdash;&#23433;&#20840;&#24615;&#30340;&#38382;&#39064;&#65292;&#26159;&#34701;&#27719;&#22312;&#39046;&#23548;&#20154;&#36873;&#20030;&#21644;&#26085;&#24535;&#22797;&#21046;&#30340;&#19968;&#31995;&#21015;&#30340;&#26465;&#26465;&#26694;&#26694;&#37324;&#38754;&#30340;&#65292;&#36890;&#36807;&#20197;&#19978;&#30340;&#38480;&#21046;&#65292;&#25105;&#20204;&#26159;&#26377;&#36275;&#22815;&#30340;&#21150;&#27861;&#26469;&#20445;&#35777;&#38598;&#32676;&#30340;&#25968;&#25454;&#30340;&#23433;&#20840;&#24615;&#30340;</p>


<p class="wp-block-paragraph ">Raft&#30340;&#31616;&#27905;&#20248;&#32654;&#65292;&#26131;&#20110;&#29702;&#35299;&#19982;&#23454;&#29616;&#65292;&#20197;&#21450;&#24615;&#33021;&#39640;&#25928;&#30340;&#29305;&#28857;&#65292;&#26159;&#24471;&#21040;&#20102;&#24037;&#19994;&#23454;&#36341;&#30340;&#35777;&#26126;&#30340;&#65292;&#34429;&#28982;Raft&#26159;&#19968;&#20010;2014&#24180;&#25165;&#25552;&#20986;&#26469;&#30340;&#26550;&#26500;&#65292;&#20294;&#26159;&#65292;&#22312;&#22914;&#20170;&#30340;&#20998;&#24067;&#24335;&#23384;&#20648;&#31995;&#32479;&#30340;&#26550;&#26500;&#20013;&#65292;&#32477;&#22823;&#22810;&#25968;&#31995;&#32479;&#30340;&#39318;&#36873;&#30340;&#31639;&#27861;&#23601;&#26159;Raft&#20849;&#35782;&#31639;&#27861;&#65292;&#27604;&#36215;Paxos&#65292;&#20197;&#21450;&#20854;&#20182;&#21313;&#22810;&#31181;&#30340;&#38750;&#25308;&#21344;&#24237;&#24335;&#20849;&#35782;&#31639;&#27861;&#26469;&#35828;&#65292;Raft&#27627;&#26080;&#30097;&#38382;&#26159;&#20248;&#32654;&#30340;&#65292;&#32500;&#25252;&#25104;&#26412;&#26356;&#20302;&#30340;&#12290;</p>


<p class="wp-block-paragraph ">&#32780;&#22823;&#21517;&#40718;&#40718;&#30340;Etcd&#65292;braft&#65292;tikv&#36825;&#31867;&#24320;&#28304;&#30340;&#20998;&#24067;&#24335;&#23384;&#20648;&#31995;&#32479;&#39033;&#30446;&#65292;&#27491;&#26159;&#22522;&#20110;Raft&#23454;&#29616;&#30340;&#12290;</p>


<p class="wp-block-paragraph aligncenter has-text-align-center aligncenter">&#26412;&#25991;&#20316;&#32773;&mdash;&mdash;&#24029;&#27969;</p>
<p><a rel="nofollow" href="/2023/08/07/raft_tutorial/">Raft：一种更容易理解的共识算法</a>最先出现在<a rel="nofollow" href="/">SZUEA</a>。</p>
]]></content:encoded>
					
					<wfw:commentRss>/2023/08/07/raft_tutorial/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
			</item>
	</channel>
</rss>
